# BuiltInFailures.CurveByPointFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurveByPointFailures Class
BuiltInFailures Class Members See Also
---
Failures about Curve By Point Element
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class CurveByPointFailures
```

Visual Basic
---
```text
Public NotInheritable Class CurveByPointFailures
```

Visual C++
---
```text
public ref class CurveByPointFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..CurveByPointFailures
# See Also
BuiltInFailures..::..CurveByPointFailures Members
Autodesk.Revit.DB Namespace